app/Controllers/Home.php

INSERT INTO `pemesanan` (`nama`, `nomor_identitas`, `jenis_kelamin`, `tipe_kamar`, `tanggal`, `durasi`, `total_bayar`, `discount`) VALUES ('Bolot', '7286482342323331', 'Laki-laki', 'Standar', '2023-09-01', '5', '2250000', 10)
---
    public function proses_pemesanan()
    {
        $data = [
            'nama' => $this->request->getPost('nama'),
            'nomor_identitas' => $this->request->getPost('nomor_identitas'),
            'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
            'tipe_kamar' => $this->request->getPost('tipe_kamar'),
            'tanggal' => $this->request->getPost('tanggal'),
            'durasi' => $this->request->getPost('durasi'),
            'total_bayar' => $this->request->getPost('total_bayar'),
        ];

        if ($this->request->getPost('durasi') > '3') {
            $data['discount'] = 10; // Nilai diskon
        } else {
            $data['discount'] = 0; // Tidak ada diskon
        }

        // Lanjutkan dengan menyimpan data ke dalam database
        $pemesanan_model = new PemesananModel();
        $pemesanan_model->insert($data);

SELECT *
FROM `pemesanan`
WHERE `pemesanan`.`id` = '5'
---
    public function hasil_pemesanan($id)
    {
        $pemesanan_model = new PemesananModel();
        $pemesanan = $pemesanan_model->find($id);